import React from 'react';
import Textarea from 'react-textarea-autosize';

export default function Profile() {
    return (
        <div className="bg-gray-900 mt-14 rounded-3xl p-5">
            <div className="flex">
                <img className="rounded-3xl" src="/static/images/setting/avatar.png" alt="" />
                <div className="ml-5 w-full">
                    <div className="flex justify-between items-start">
                        <div className="relative w-2/3">
                            <input 
                                className="w-full bg-secondaryBlack rounded-3xl focus:outline-none font-bold text-3xl px-7 py-1"
                                type="text"
                                placeholder="NickName" 
                            />
                            <div className="absolute right-7 top-1/3 cursor-text">
                                <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0)">
                                        <path d="M8.0282 2.18359L0.875419 9.33689C0.839433 9.37298 0.813449 9.41856 0.801076 9.46754L0.00825802 12.6497C-0.0154574 12.7455 0.0126918 12.8474 0.0826008 12.9173C0.135497 12.9702 0.207571 12.9995 0.281295 12.9995C0.303876 12.9995 0.326973 12.9967 0.349451 12.991L3.53165 12.1981C3.58125 12.1857 3.62631 12.1599 3.66229 12.1239L10.8157 4.97109L8.0282 2.18359Z" fill="#3A3A3A"/>
                                        <path d="M12.5877 1.20784L11.7914 0.411617C11.2593 -0.120536 10.3318 -0.120021 9.80027 0.411617L8.82495 1.38694L11.6123 4.17433L12.5877 3.19901C12.8535 2.93329 12.9999 2.57962 12.9999 2.20347C12.9999 1.82733 12.8535 1.47366 12.5877 1.20784Z" fill="#3A3A3A"/>
                                    </g>
                                    <defs>
                                        <clipPath id="clip0">
                                            <rect width="13" height="13" fill="white"/>
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                        </div>
                        <div className="flex items-center cursor-pointer">
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M14.354 9.14376L12.9752 8.06563C12.9927 7.89937 13.0077 7.70502 13.0077 7.49938C13.0077 7.29375 12.9933 7.09939 12.9752 6.93314L14.3552 5.85439C14.6115 5.65189 14.6815 5.29251 14.5183 4.99315L13.0846 2.5125C12.9315 2.23251 12.5958 2.08875 12.2552 2.21438L10.6283 2.86749C10.3165 2.64249 9.98958 2.4525 9.65147 2.30063L9.40396 0.57501C9.36333 0.2475 9.07833 0 8.74148 0H5.86649C5.5296 0 5.24525 0.2475 5.20523 0.57L4.95711 2.30188C4.6296 2.44939 4.30774 2.63689 3.98211 2.86875L2.35086 2.21376C2.04521 2.09563 1.67958 2.22812 1.52771 2.50688L0.0921015 4.99063C-0.0772637 5.27689 -0.00727348 5.64876 0.254611 5.85627L1.63335 6.93439C1.61147 7.14501 1.60086 7.32814 1.60086 7.50003C1.60086 7.67191 1.6115 7.85502 1.63335 8.06628L0.253351 9.14502C-0.00290824 9.34813 -0.0722832 9.70752 0.0908417 10.0063L1.5246 12.4869C1.67774 12.7663 2.01023 12.9113 2.35397 12.785L3.98085 12.1319C4.2921 12.3563 4.61897 12.5463 4.95711 12.6988L5.20461 14.4238C5.24522 14.7525 5.5296 15 5.8671 15H8.74209C9.07897 15 9.36397 14.7525 9.40396 14.43L9.65208 12.6988C9.97959 12.5506 10.3008 12.3637 10.6271 12.1312L12.2583 12.7862C12.3371 12.8169 12.419 12.8325 12.5033 12.8325C12.7458 12.8325 12.969 12.7 13.0815 12.4937L14.5215 9.99999C14.6815 9.70749 14.6115 9.34813 14.354 9.14376ZM7.30397 9.99999C5.92523 9.99999 4.80398 8.87874 4.80398 7.5C4.80398 6.12126 5.92523 5.00001 7.30397 5.00001C8.68271 5.00001 9.80396 6.12126 9.80396 7.5C9.80396 8.87874 8.68271 9.99999 7.30397 9.99999Z" fill="#969696"/>
                            </svg>
                            <div className="ml-2 text-sm text-gray-400">Личный кабинет</div>
                        </div>
                    </div>
                    <Textarea 
                        className="mt-5 w-11/12 h-auto bg-secondaryBlack rounded-2xl focus:outline-none resize-none overflow-hidden px-4 py-2.5"
                        placeholder="Тут можно написать пару пацанских цитат. Желательно совсем не очень которые. Прям ну фу, а не цитаты. Поэтому я лучше тут напишу несколько строк какой-нибудь несвязанной речи. Ну, мало ли несколько строк."
                    />
                    <div className="w-11/12 pr-5 flex justify-end">
                        <div className="font-medium text-sm text-gray-500">235/500</div>
                    </div>
                    <div className="flex items-center">
                        <button className="bg-gradient-to-r from-yellow-300 to-pink rounded-full px-5 py-2 focus:outline-none">
                            <div className="flex items-center">
                                <div className="mr-4 font-bold uppercase text-sm">premium</div>
                                <svg width="25" height="19" viewBox="0 0 21 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M19.9799 3.57974C19.7487 3.37738 19.4224 3.33473 19.149 3.47121L14.9652 5.55954L11.0396 0.918729C10.8944 0.747053 10.6836 0.648438 10.462 0.648438C10.2404 0.648438 10.0296 0.747053 9.88442 0.918729L5.95877 5.5595L1.77502 3.47117C1.50158 3.33473 1.17534 3.37734 0.944069 3.5797C0.712794 3.78207 0.620436 4.10575 0.708856 4.40402L3.61414 14.2029C3.71204 14.5331 4.00903 14.7588 4.34562 14.7588H16.5784C16.9149 14.7588 17.212 14.5331 17.3098 14.2029L20.2151 4.40406C20.3036 4.10579 20.2112 3.78211 19.9799 3.57974ZM16.0117 13.191H4.91226L2.68166 5.66749L5.81714 7.2326C6.12847 7.38797 6.50256 7.3095 6.72936 7.0414L10.462 2.62879L14.1947 7.0414C14.4214 7.30954 14.7956 7.38793 15.1069 7.2326L18.2423 5.66749L16.0117 13.191Z" fill="#FFD260"/>
                                </svg>
                            </div>
                        </button>
                        <div className="ml-8 text-sm text-gray-400">
                            Нажми и узнай о преимуществах BloodGodz premium
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};